<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Lit-devel] Grundidee, ...
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/lit-devel/2005-August/index.html" >
   <LINK REL="made" HREF="mailto:lit-devel%40lists.berlios.de?Subject=Re%3A%20%5BLit-devel%5D%20Grundidee%2C%20...&In-Reply-To=%3C3539970305082718523c34f99b%40mail.gmail.com%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   
   <LINK REL="Next"  HREF="000001.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Lit-devel] Grundidee, ...</H1>
    <B>Gerfried Reis</B> 
    <A HREF="mailto:lit-devel%40lists.berlios.de?Subject=Re%3A%20%5BLit-devel%5D%20Grundidee%2C%20...&In-Reply-To=%3C3539970305082718523c34f99b%40mail.gmail.com%3E"
       TITLE="[Lit-devel] Grundidee, ...">shootrell at gmail.com
       </A><BR>
    <I>Sun Aug 28 03:52:50 CEST 2005</I>
    <P><UL>
        
        <LI>Next message: <A HREF="000001.html">[Lit-devel] Grundidee, ...
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#0">[ date ]</a>
              <a href="thread.html#0">[ thread ]</a>
              <a href="subject.html#0">[ subject ]</a>
              <a href="author.html#0">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Hallo!

Erstmal: Hallo Simon, willkommen bei lit!

Es ist zwar schon ein bissl sp&#228;t, und bef&#252;rchte, dass ich einiges ned
wirklich ganz strukturiert r&#252;berbringen werde, aber ich m&#246;cht im
Folgenden mal die Motivation, die Grundidee und ein paar der features
recht oberfl&#228;chlich erkl&#228;ren, die mir momentan so im Kopf schweben.
Nat&#252;rlich ist das erstmal nur meine Sicht des Projekts. Da das ganze
erst seit ca. 1 Woche am laufen ist, und wolle u. ich noch nicht sehr
viel Zeit hatten, um uns &#252;ber die genauen Ziele, und schon gar nicht
&#252;ber konkrete Features Gedanken zu machen, ist mit Zieldefinitionen,
die wir gemeinsam erstellen, fr&#252;hestens in ein paar Wochen zu rechnen,
denke ich.

Motivation: Letzten Herbst habe ich begonnen, recht intensiv
Franz&#246;sisch zu lernen, und da vor allem Vokabel. Meine alten
AHS-Franz&#246;sischb&#252;cher haben im Anhang jeweils zu jeder Lektion das
passende Vokabular, zweispaltig, grunds&#228;tzlich gut lernbar. In ca. 4
Wochen habe ich die Vokabel von 4 Jahren Franz&#246;sischunterricht
durchgemacht. Kurzzeitig konnte ich die sogar alle. Nur vergisst man
diese Dinge ohne Wiederholung bekanntlich einfach ziemlich leicht. Das
Problem war nun, dass es sehr ineffizient ist, die gleichen Seiten mit
den gleichen Vokabeln immer wieder durchzulesen. Es gibt Vokabel, die
man sich aus verschiedenen Gr&#252;nden leichter merkt, und solche, die
einfach schwieriger sind. Beim Wiederholen mittels besagter B&#252;cher
musste ich dann bei der 3. Wiederholung oft 50 Vokabel lesen, die ich
ohnehin gewusst hatte, um auf eines zu sto&#223;en, das mir wieder
entfallen war. Dabei wurden dann auch wieder Vokabel, die ich
eigentlich noch nicht kannte &#252;bersehen.
Somit war das Wiederholen teilweise verschwendete Zeit, die mir f&#252;r
das Lernen von neuem wieder fehlte.  Au&#223;erdem fehlte einfach der
&#252;berblick - welche Lektionen konnte ich schon eher gut, welche weniger
gut? Bei 4 mal ungef&#228;hr 15 Lektionen, die meistens in A, B und C
unterteilt waren, war es unm&#246;glich, im Ged&#228;chtnis zu behalten, welche
Lektionen als n&#228;chstes wiederholt werden sollten.
Aufgrund dieser Probleme (und anderer, die mir momentan nicht
einfallen), habe ich dann begonnen, mich nach effizienteren Methoden
zu erkundigen, und stie&#223; auf das (ohnehin recht bekannte)
Leitner-System/Flashcard-learning/Karteikarten-lernen, oder wie man es
sonst auch nennt. Hier nur eine ganz kurze Beschreibung des Systems,
im Netz finden sich ohnehin gen&#252;gend Quellen:
Die Idee ist, Lernstoff auf Karten aufzuteilen, auf der Vorderseite
steht eine Frage, auf der R&#252;ckseite eine Antwort. Man beginnt mit
einem Sto&#223; von ungelernten Karten. Eine gewisse Zeitspanne lang pr&#228;gt
man sich Fragen und Antworten f&#252;r eine Anzahl von Karten ein, danach
werden diese &quot;abgefragt&quot;. Es geht dabei nicht darum, die Antwort zu
einer Frage genau zu wissen. Fragen der Art &quot;beschreibe das System
XYZ&quot;, und eine ausf&#252;hrliche Antwort, die man nicht wortw&#246;rtlich, aber
dem Sinn nach wiedergeben kann, sind nat&#252;rlich genauso denkbar.
Trotzdem ist das System sicher f&#252;r gewisse Arten von Lernstoff
geeigneter als f&#252;r andere. So z.b. f&#252;r Fakten-Lernlastige Stoffgebiete
wie Geschichte sicher eher, als f&#252;r Mathematik.
Wei&#223; man eine Antwort, wird die Karte auf einen neuen Stapel gelegt.
Das Wissen dieser Karte ist nun im Ultra-Kurzzeitged&#228;chtnis. Wenn es
an der Zeit ist, die Karten des neuen Stapels wieder abzufragen,
wandern die neuerlich richtig beantworteten Fragen wieder auf einen
neuen Stapel, usw. (Kurzzeitged&#228;chnis, Langzeitged&#228;chtnis 1,
Langzeitged&#228;chtnis 2, ...).
Die Intervalle zwischen den Wiederholungen werden dabei immer l&#228;nger,
je h&#246;her die Stapelnummerierung ist. (Zwischen Ultrakurzzeitged&#228;chtnis
und Kurzzeitged&#228;chtnis vielleicht nur ein paar Stunden, zwischen
Langzeitged&#228;chtnis 7 und Langzeitged&#228;chtnis 8 aber einige Monate).
Fragen, die nicht beantwortet werden k&#246;nnen, wandern wieder auf den
vorherigen Stapel zur&#252;ck.

Dieses System verhindert genau die Probleme, die ich beim intensiven
Vokabellernen hatte. Bereits bekanntes wird nicht sinnlos wiederholt,
Wissensl&#252;cken werden aufgedeckt, etc.

Nun ist es aber nicht m&#246;glich, real-life-Karteikarten f&#252;r mehr als ein
paar Vokabel zu verwalten, da man &#252;ber hunderte von Karteikarten Buch
f&#252;hren m&#252;sste (auf welchem Stapel sie liegen, wann f&#252;r welchen Stapel
wieder eine Wiederholung f&#228;llig ist, etc. -&gt; v.a. wenn man
verschiedene Stoffgebiete mit diesem System lernt, wird der
Verwaltungsoverhead bald zu gro&#223;) somit bietet sich eine
Softwareumsetzung an.

Dies ist nur die urspr&#252;ngliche Motivation - lit soll kein
Vokabeltrainer werden (obwohl es daf&#252;r nat&#252;rlich geeignet sein soll)!

Motivation 2: Ich wei&#223; nicht, wie ihr das macht, aber wenn ich im Web
surfe, habe ich meistens ein Editorfenster mit meinem Notizzettel
offen, wo ich alles interessante, neue, wissenswerte eintrage, das mir
so unterkommt. Das Problem dabei ist: Meistens sehe ich mir die Dinge
nie wieder an, weil ich einfach nicht dazu komme. Sie geraten in
Vergessenheit, obwohl ich sie eigentlich notiert hatte. Wenn mich ein
Tool in geeigneten Intervallen auf meine Notizen hinweisen w&#252;rde,
k&#246;nnte ich mir interessante Sachen erstens bei Gelegenheit tats&#228;chlich
mal ansehen (obwohl ich zum Zeitpunkt, als ich sie mir notiert hatte,
keine Zeit daf&#252;r hatte), und w&#252;rde Wissen, dass ich irgendwo
aufgeschnappt hatte, im Normalfall aber wieder vergessen w&#252;rde, auch
irgendwann wirklich verinnerlichen. Das Tool m&#252;sste nat&#252;rlich
intelligent genug sein, um mich nicht zu nerven, aber mir die
Gelegenheit geben, &quot;nebenbei&quot; zu lernen.

Es lie&#223;en sich sicher noch mehr Beispiele finden, aber da's
mittlerweile sp&#228;t wird, m&#246;cht ich mal weitermachen ;-)

-&gt; Mir schwebt eine Art &quot;Lernmanager auf Flashcard-Basis&quot; vor. Die
Karteikartenidee finde ich einfach einleuchtend gut (habe sie auch f&#252;r
Vokabel getestet, das ganze ist wirklich weit effizienter als lineares
Lesen).
Desweiteren steht sie nicht im Widerspruch zu anderen Lernmethoden,
sondern l&#228;sst sich wunderbar erg&#228;nzen. Als Beispiel fallen mir
Mindmaps ein. Mindmaps erheben den Anspruch, lineares Lernen zu
vermeiden, und dem Ged&#228;chtnis durch verschiedene Mittel auf die
Spr&#252;nge zu helfen, der nat&#252;rlichen Arbeitsweise des Gehirns zu
entsprechen, etc.
Nun spricht ja nichts dagegen, z.b. alle R&#252;ckseiten der Karten
(=Antworten) als Mindmaps zu gestalten. Die entsprechende Fragen dazu
w&#228;ren vermutlich allgemein gehalten, die Antworten eben so detailliert
wie n&#246;tig (&quot;Welche Sortieralgorithmen kennst du, was sind deren
Unterschiede, was wei&#223;t du &#252;ber ihre Komplexit&#228;t?&quot;, und eine Mindmap
als Antwort).
So w&#252;rde der Lernmanager daf&#252;r sorgen, den Lernstoff zu strukturieren
(z.B.: Sortieralgorithmen werden gr&#246;&#223;tenteils schon beherrscht, die
meisten Karten dazu finden sich bereits in Langzeitged&#228;chtnis 1,
quicksort ist allerdings noch in Kurzzeitged&#228;chtnis verblieben;
Suchalgorithmen sind allerdings gr&#246;&#223;tenteils noch in
Ultrakurzzeitged&#228;chntis), wiederholt w&#252;rden nur die Einheiten, f&#252;r die
das n&#246;tig w&#228;re. Gleichzeitig w&#252;rde das Gehirn beim eigentlichen Lernen
durch die Darstellung des Stoffes als Mindmaps unterst&#252;tzt.
Durch die Visualisierung der Kartenstapel (evtl. mit Kennzeichnung der
in den Stapeln enthaltenen Stoffgebiete) w&#252;rde dem Lernenden ein
&#220;berblick &#252;ber den beherrschten Stoff vermittelt, etc.
Mindmaps sind hier nat&#252;rlich nur ein Beispiel - jede Art der
Aufbereitung des Lernstoffs w&#228;re denkbar. Ich sehe den Lernmanager
hier als eine Art Meta-Tool, ein Tool, das das Lernen erleichtert, den
Lernenden dabei unterst&#252;tzt, zum richtigen Zeitpunkt den richtigen
Stoff zu wiederholen und so der Tendenz des Gehirns, unbenutztes zu
vergessen entgegenwirkt, ohne aber dem Lernenden Schranken
aufzuerlegen. V.a. soll lit kein tool sein, das Auswendiglernen
f&#246;rdert. Nat&#252;rlich kann es auch daf&#252;r eingesetzt werden, dies h&#228;ngt
jedoch einzig und allein von der Aufbereitung des Lernstoffs ab. Bei
Fragen und Antworten der Art: &quot;Welches Land wurde 1066 von Wilhelm
erobert&quot; - &quot;England&quot; tritt nat&#252;rlich Auswendiglernen ein.
Lit ist lediglich daf&#252;r gedacht, das Gehirn daran zu hindern, der
nat&#252;rlichen Vergessneigung nachzugeben, sowie die Lerneffizienz
dadurch zu erh&#246;hen, sinnloses Wiederholen zu vermeiden.

Nat&#252;rlich w&#252;nscht nicht jeder User die gleiche Art von Visualisierung,
die verschiedensten Arten der Darstellung des Lernstoffes sind
denkbar, verschiedene Betriebssysteme werden eingesetzt, etc.
Deshalb m&#246;chte ich Modularit&#228;t und Flexibilit&#228;t zu einem Hauptziel
machen. Lit soll kein simples Programm sein, sondern erstmal ein
Framework mit vielen wiederverwendbaren Modulen. Kein einzelnes
standalone-Programm, sondern eine Sammlung von Modulen, die sich
m&#246;glichst beliebig kombinieren lassen. Verschiedenartigstes backends
(sql-Datenbanken, xml, textfiles, ...) sollen unterst&#252;tzt werden,
intelligente Lernmanager-Module sollen diese mit verschiedenen
Frontends (f&#252;r console, X11, Windows, MacOS, native Implementierungen,
java, webclients, ...) verbinden, dazwischen sollen universell
verwendbare Interfaces stehen.
Desweiteren soll f&#252;r die Frontends Usability Top-Priorit&#228;t sein. Ich
m&#246;chte, dass das tool benutzt wird, und ein tool wie kvocabulary oder
pauker kann und will man nicht benutzen (obwohl sie ansonsten sicher
nicht schlecht sind).
Im Idealfall soll der User nicht selbst dran denken m&#252;ssen, hin u.
wieder sein &quot;Lernprogramm&quot; zu starten. Intelligente Agenten sollen im
Hintergrund arbeiten, und den User _unaufdringlich_ darauf hinweisen,
dass es an der Zeit ist, dies oder jenes zu wiederholen. Dies soll
nicht passieren, wenn der User offensichtlich damit besch&#228;ftigt ist,
Quake zu spielen, eine wichtige Arbeit zu erledigen, etc.
PIM-Usern k&#246;nnten empfohlene Lerntermine z.b. in ihren Terminkalender
eingetragen werden.
Frontends sollen zumindest leichtgewichtig wirken. Der user soll &quot;mal
eben schnell&quot; ein paar Karten lernen k&#246;nnen, und nicht ein
umst&#228;ndliches, langsames bloat-tool starten m&#252;ssen.
Eigene Flashcard-Server k&#246;nnten zentral Karteikarten verwalten und anbieten. 

Der Lernmanager soll die erw&#228;hnte &quot;Notizzettelfunktionalit&#228;t&quot; haben.

Parallelprojekte k&#246;nnten daf&#252;r sorgen, Uni-Skripten elektronisch umzusetzen.

In wie weit dies alles realisierbar ist, was davon als
Kernfunktionalit&#228;t zuerst umgesetzt werden soll, etc. muss nat&#252;rlich
erst besprochen werden. Dies waren nur mal einige meiner Ideen zum
Thema.

Zusammenfassend: 

lit 
 - soll m&#246;glichst angenehm benutzbar sein
 - soll m&#228;chtig und flexibel sein (verschiedene Algorithmen,
verschiedene Datenquellen (lokal, verteilt, ...), verschiedene
Visualisierungen, ...)
 - soll modular sein
 - soll intelligent sein
 - soll unterst&#252;tzen und nicht bevormunden
 - soll die Vergessneigung des Gehirns bek&#228;mpfen 

Ich wei&#223; nicht, ob das alles besonders klar r&#252;berkommt - bei Fragen
bitte gleich emailen, ich werde ab 30.8. vermutlich f&#252;r einige Wochen
kein Netz mehr haben, und auch so wenig Zeit.

Gute Nacht!
Gerfried

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	
	<LI>Next message: <A HREF="000001.html">[Lit-devel] Grundidee, ...
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#0">[ date ]</a>
              <a href="thread.html#0">[ thread ]</a>
              <a href="subject.html#0">[ subject ]</a>
              <a href="author.html#0">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/lit-devel">More information about the Lit-devel
mailing list</a><br>
</body></html>
